denote/20230601T205447--2023-06でやること__term.org
#+title:      2023-06でやること
#+date:       [2023-06-01 Thu 20:54]
#+filetags:   :term:
#+identifier: 20230601T205447

* やること
- [X] garbanzoをとりあえず使えるようにする
* DONE コメント
CLOSED: [2023-07-02 Sun 01:17]
- 06-01
  - garbanzoを作っている。Goroutineの競合や、起動直後に読み込まない問題を解決した
  - イメージでの動作確認をやった。埋め込みがなく、バイナリだけで動作してなかった
  - ディストロレスの軽量イメージを使ったら800MB->5MBになって感動した
- 06-07
  - garbanzoがだいたい終わった。いい感じに使える。落ちることは一切ない
  - [[https://github.com/moby/moby/issues/45317#issuecomment-1578607259][Revert "seccomp: block socket calls to AF_VSOCK in default profile" (commit 57b2290) · Issue #45317 · moby/moby]]
    - vsockは高速な仮想ソケット
  - そもそも、仕様をそんなに考えたことがない。使う側としても
  - まずやりとりを理解するところからだ
- 06-10
  - 通知を読んでいる。Feedも同じように表示したい
  - iframe問題と、既読をどうするかが問題になる
  - とりあえず各通知に遷移できるようにする
- 06-11
  - 『コーディングを支える技術』を読み終わった。まあ一般的な説明という感じ
  - garbanzoに統計を追加した
- 06-19
  - 「今週のチェック項目」としてエントリにしたい
  - denoteの配信をしようと考えて調べたけど、いいのがない
- 06-20
  - feedを読んだ。あまりわからない。眠い
- 06-24
- 06-26
  - dlvでlen()するとスルーする。組み込みだからか
  - file_posixは結局のところシステムコールを呼ぶ
- 06-28
  - デバッガでサーバのコードを読んでる
  - ソケットまわりも当然ながら、結局はファイルディスクリプタで、システムコール
  - リクエストを受け取ったときのデバッグはどうやるんだろう
  - 先にハンドラの中身にブレークポイントを入れておけばよさそうな
* News

気になったトピックのメモ。

** [[https://www.rfc-editor.org/rfc/rfc9425.html][RFC 9425: JSON Meta Application Protocol (JMAP) for Quotas]]
JMAPは、電子メールの処理に関するインターネット標準の通信プロトコルのセット。メールやカレンダー、連絡先といった一般的なデータの同期するためのプロトコルでもある。

- [[https://ja.wikipedia.org/wiki/JSON_Meta_Application_Protocol][JSON Meta Application Protocol - Wikipedia]]

そのJMAPのQuotaの仕様。

** [[https://www.rfc-editor.org/rfc/rfc9408.html][RFC 9408: A YANG Network Data Model for Service Attachment Points (SAPs)]]
YANGはデータモデル言語の一種。ネットワーク管理用プロトコルによりアクセスされるネットワーク機器の設定や状態、RPC、通知をモデル化するために開発された。

- [[https://ja.wikipedia.org/wiki/YANG][YANG - Wikipedia]]

** [[https://github.com/docker/compose/pull/10552][introduce ability to select service to be stopped by `compose down` by ndeloof · Pull Request #10552 · docker/compose]]

個別にdownできるようになった。これがなかったからややこしいコマンドをやる必要があった。

** [[https://github.com/golang/go/issues/17860][net/url: optimize unescape and escape · Issue #17860 · golang/go]]
URLに関係する関数での高速化の方法。
** [[https://github.com/golang/go/issues/38017][time: add time/tzdata package and timetzdata tag to embed tzdata in program · Issue #38017 · golang/go]]
タイムゾーン情報をシステム依存でなく、プログラム内にもたせる変更。
** [[https://github.com/golang/go/issues/45624][proposal: expression to create pointer to simple types · Issue #45624 · golang/go]]
気になる提案。
** [[http://localhost:8081/golang/go/issues/51317#top][proposal: arena: new package providing memory arenas · Issue #51317 · golang/go · GitHub]]
arenaのproposal。
** Go 1.21のリリース候補がダウンロード可能になった
[[https://go.dev/blog/go1.21rc][Go 1.21 リリース候補 - Go プログラミング言語]]
