denote/20230601T205447--2023-06でやること__term.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-11-12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2023-06でやること</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">2023-06でやること</h1>

<div id="outline-container-org5f8b2bc" class="outline-2">
<h2 id="org5f8b2bc"><a href="#org5f8b2bc">やること</a></h2>
<div class="outline-text-2" id="text-org5f8b2bc">
<ul class="org-ul">
<li class="on"><code>[X]</code> garbanzoをとりあえず使えるようにする</li>
</ul>
</div>
</div>
<div id="outline-container-org1f4b2a9" class="outline-2">
<h2 id="org1f4b2a9"><a href="#org1f4b2a9"><span class="done DONE">DONE</span> コメント</a></h2>
<div class="outline-text-2" id="text-org1f4b2a9">
<ul class="org-ul">
<li>06-01
<ul class="org-ul">
<li>garbanzoを作っている。Goroutineの競合や、起動直後に読み込まない問題を解決した</li>
<li>イメージでの動作確認をやった。埋め込みがなく、バイナリだけで動作してなかった</li>
<li>ディストロレスの軽量イメージを使ったら800MB-&gt;5MBになって感動した</li>
</ul></li>
<li>06-07
<ul class="org-ul">
<li>garbanzoがだいたい終わった。いい感じに使える。落ちることは一切ない</li>
<li><a href="https://github.com/moby/moby/issues/45317#issuecomment-1578607259">Revert &ldquo;seccomp: block socket calls to AF_VSOCK in default profile&rdquo; (commit 57b2290) · Issue #45317 · moby/moby</a>
<ul class="org-ul">
<li>vsockは高速な仮想ソケット</li>
</ul></li>
<li>そもそも、仕様をそんなに考えたことがない。使う側としても</li>
<li>まずやりとりを理解するところからだ</li>
</ul></li>
<li>06-10
<ul class="org-ul">
<li>通知を読んでいる。Feedも同じように表示したい</li>
<li>iframe問題と、既読をどうするかが問題になる</li>
<li>とりあえず各通知に遷移できるようにする</li>
</ul></li>
<li>06-11
<ul class="org-ul">
<li>『コーディングを支える技術』を読み終わった。まあ一般的な説明という感じ</li>
<li>garbanzoに統計を追加した</li>
</ul></li>
<li>06-19
<ul class="org-ul">
<li>「今週のチェック項目」としてエントリにしたい</li>
<li>denoteの配信をしようと考えて調べたけど、いいのがない</li>
</ul></li>
<li>06-20
<ul class="org-ul">
<li>feedを読んだ。あまりわからない。眠い</li>
</ul></li>
<li>06-24</li>
<li>06-26
<ul class="org-ul">
<li>dlvでlen()するとスルーする。組み込みだからか</li>
<li>file_posixは結局のところシステムコールを呼ぶ</li>
</ul></li>
<li>06-28
<ul class="org-ul">
<li>デバッガでサーバのコードを読んでる</li>
<li>ソケットまわりも当然ながら、結局はファイルディスクリプタで、システムコール</li>
<li>リクエストを受け取ったときのデバッグはどうやるんだろう</li>
<li>先にハンドラの中身にブレークポイントを入れておけばよさそうな</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8c9eece" class="outline-2">
<h2 id="org8c9eece"><a href="#org8c9eece">News</a></h2>
<div class="outline-text-2" id="text-org8c9eece">
<p>
気になったトピックのメモ。
</p>
</div>

<div id="outline-container-org0021969" class="outline-3">
<h3 id="org0021969"><a href="#org0021969"><a href="https://www.rfc-editor.org/rfc/rfc9425.html">RFC 9425: JSON Meta Application Protocol (JMAP) for Quotas</a></a></h3>
<div class="outline-text-3" id="text-org0021969">
<p>
JMAPは、電子メールの処理に関するインターネット標準の通信プロトコルのセット。メールやカレンダー、連絡先といった一般的なデータの同期するためのプロトコルでもある。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/JSON_Meta_Application_Protocol">JSON Meta Application Protocol - Wikipedia</a></li>
</ul>

<p>
そのJMAPのQuotaの仕様。
</p>
</div>
</div>

<div id="outline-container-org63843d1" class="outline-3">
<h3 id="org63843d1"><a href="#org63843d1"><a href="https://www.rfc-editor.org/rfc/rfc9408.html">RFC 9408: A YANG Network Data Model for Service Attachment Points (SAPs)</a></a></h3>
<div class="outline-text-3" id="text-org63843d1">
<p>
YANGはデータモデル言語の一種。ネットワーク管理用プロトコルによりアクセスされるネットワーク機器の設定や状態、RPC、通知をモデル化するために開発された。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/YANG">YANG - Wikipedia</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0658612" class="outline-3">
<h3 id="org0658612"><a href="#org0658612"><a href="https://github.com/docker/compose/pull/10552">introduce ability to select service to be stopped by `compose down` by ndeloof · Pull Request #10552 · docker/compose</a></a></h3>
<div class="outline-text-3" id="text-org0658612">
<p>
個別にdownできるようになった。これがなかったからややこしいコマンドをやる必要があった。
</p>
</div>
</div>

<div id="outline-container-orgae8d0c0" class="outline-3">
<h3 id="orgae8d0c0"><a href="#orgae8d0c0"><a href="https://github.com/golang/go/issues/17860">net/url: optimize unescape and escape · Issue #17860 · golang/go</a></a></h3>
<div class="outline-text-3" id="text-orgae8d0c0">
<p>
URLに関係する関数での高速化の方法。
</p>
</div>
</div>
<div id="outline-container-orge639405" class="outline-3">
<h3 id="orge639405"><a href="#orge639405"><a href="https://github.com/golang/go/issues/38017">time: add time/tzdata package and timetzdata tag to embed tzdata in program · Issue #38017 · golang/go</a></a></h3>
<div class="outline-text-3" id="text-orge639405">
<p>
タイムゾーン情報をシステム依存でなく、プログラム内にもたせる変更。
</p>
</div>
</div>
<div id="outline-container-org51a7c5b" class="outline-3">
<h3 id="org51a7c5b"><a href="#org51a7c5b"><a href="https://github.com/golang/go/issues/45624">proposal: expression to create pointer to simple types · Issue #45624 · golang/go</a></a></h3>
<div class="outline-text-3" id="text-org51a7c5b">
<p>
気になる提案。
</p>
</div>
</div>
<div id="outline-container-orgd700f63" class="outline-3">
<h3 id="orgd700f63"><a href="#orgd700f63"><a href="http://localhost:8081/golang/go/issues/51317#top">proposal: arena: new package providing memory arenas · Issue #51317 · golang/go · GitHub</a></a></h3>
<div class="outline-text-3" id="text-orgd700f63">
<p>
arenaのproposal。
</p>
</div>
</div>
<div id="outline-container-orgffafd72" class="outline-3">
<h3 id="orgffafd72"><a href="#orgffafd72">Go 1.21のリリース候補がダウンロード可能になった</a></h3>
<div class="outline-text-3" id="text-orgffafd72">
<p>
<a href="https://go.dev/blog/go1.21rc">Go 1.21 リリース候補 - Go プログラミング言語</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
